applications/solvers/mySolver/pimpleFoam/LES/NACA4412/system/wallFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

wallShearStress
{
    type            wallShearStress;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeControl    writeTime;

    patches         ( aerofoil );
}

yPlus
{
    type            yPlus;
    libs            (fieldFunctionObjects);

    enabled         true;
    writeControl    writeTime;

    patches         ( aerofoil );
}

// ************************************************************************* //
